# St7GetWindowImageLocation

Returns the location of the image used for bgImage and bgImageGradient background modes.

long St7GetWindowImageLocation(long uID, long* ImageLocation)

Input Parameters

uID

Strand7 model file ID.

Model Window

Output Parameters
ImageLocation

One of ilCentre, ilTile, ilStretch, ilTopLeft, ilTopRight, ilBottomLeft, ilBottomRight.